hpmicro/hpm_sdk/soc/HPM5E00/HPM5E3Y/hpm_csr_regs.h
/*
 * XS (RO)
 *
 * XS holds the status of the architectural states (ACE registers) of ACE instructions. The value of this field is zero if ACE extension is not configured.
 * This field is primarily managed by software. The processor hardware assists the state managements in two regards:
 * Illegal instruction exceptions are triggeredwhen XS is Off.
 * XS is updated to the Dirty state with the execution of ACE instructions when XS is not Off.
 * Changing the setting of this field has no effect on the contents of ACE states. In particular, setting XS to Off does not destroy the states, nor does setting XS to Initial clear the contents.
 * The same copy of XS bits are shared by both mstatus and sstatus. Normally the supervisor mode privileged software would use the XS bits to manage deferred context switches of ACE states. Machine mode software should be more conservative in managing context switches using XS bits
 * 0:Off
 * 1:Initial
 * 2:Clean
 * 3:Dirty
 */
#define CSR_SSTATUS_XS_MASK (0x18000UL)
#define CSR_SSTATUS_XS_SHIFT (15U)
#define CSR_SSTATUS_XS_GET(x) (((uint32_t)(x) & CSR_SSTATUS_XS_MASK) >> CSR_SSTATUS_XS_SHIFT)

/*
 * FS (RW)
 *
 * FS holds the status of the architectural states of the floating-point unit, including the fcsr CSR and f0 – f31 floating-point data registers. The value of this field is zero and read-only if the processor does not have FPU.
 * This field is primarily managed by software. The processor hardware assists the state managements in two regards:
 * Attempts to access fcsr or any f register raise an illegal-instruction exception when FS is Off.
 * Otherwise, FS is updated to the Dirty state by any instruction that updates fcsr or any f register.
 * Changing the setting of this field has no effect on the contents of the floating-point register states. In particular, setting FS to Off does not destroy the states, nor does setting FS to Initial clear the contents.
 * The same copy of FS bits are shared by both mstatus and sstatus. Normally the supervisor mode privileged software would use the FS bits to manage deferred context switches of FPU states. Machine mode software should be more conservative in managing context switches using FS bits.
 * 0:Off
 * 1:Initial
 * 2:Clean
 * 3:Dirty
 */
#define CSR_SSTATUS_FS_MASK (0x6000U)
#define CSR_SSTATUS_FS_SHIFT (13U)
#define CSR_SSTATUS_FS_SET(x) (((uint32_t)(x) << CSR_SSTATUS_FS_SHIFT) & CSR_SSTATUS_FS_MASK)
#define CSR_SSTATUS_FS_GET(x) (((uint32_t)(x) & CSR_SSTATUS_FS_MASK) >> CSR_SSTATUS_FS_SHIFT)

/*
 * SPP (RW)
 *
 * SPP holds the privilege mode prior to a trap. Encoding is 1 for S-mode and 0 for U-mode.
 */
#define CSR_SSTATUS_SPP_MASK (0x100U)
#define CSR_SSTATUS_SPP_SHIFT (8U)
#define CSR_SSTATUS_SPP_SET(x) (((uint32_t)(x) << CSR_SSTATUS_SPP_SHIFT) & CSR_SSTATUS_SPP_MASK)
#define CSR_SSTATUS_SPP_GET(x) (((uint32_t)(x) & CSR_SSTATUS_SPP_MASK) >> CSR_SSTATUS_SPP_SHIFT)

/*
 * SPIE (RW)
 *
 * SPIE holds the value of the SIE bit prior to a trap.
 */
#define CSR_SSTATUS_SPIE_MASK (0x20U)
#define CSR_SSTATUS_SPIE_SHIFT (5U)
#define CSR_SSTATUS_SPIE_SET(x) (((uint32_t)(x) << CSR_SSTATUS_SPIE_SHIFT) & CSR_SSTATUS_SPIE_MASK)
#define CSR_SSTATUS_SPIE_GET(x) (((uint32_t)(x) & CSR_SSTATUS_SPIE_MASK) >> CSR_SSTATUS_SPIE_SHIFT)

/*
 * UPIE (RW)
 *
 * UPIE holds the value of the UIE bit prior to a trap.
 */
#define CSR_SSTATUS_UPIE_MASK (0x10U)
#define CSR_SSTATUS_UPIE_SHIFT (4U)
#define CSR_SSTATUS_UPIE_SET(x) (((uint32_t)(x) << CSR_SSTATUS_UPIE_SHIFT) & CSR_SSTATUS_UPIE_MASK)
#define CSR_SSTATUS_UPIE_GET(x) (((uint32_t)(x) & CSR_SSTATUS_UPIE_MASK) >> CSR_SSTATUS_UPIE_SHIFT)

/*
 * SIE (RW)
 *
 * S mode interrupt enable bit
 * 0 Disabled
 * 1 Enabled
 */
#define CSR_SSTATUS_SIE_MASK (0x2U)
#define CSR_SSTATUS_SIE_SHIFT (1U)
#define CSR_SSTATUS_SIE_SET(x) (((uint32_t)(x) << CSR_SSTATUS_SIE_SHIFT) & CSR_SSTATUS_SIE_MASK)
#define CSR_SSTATUS_SIE_GET(x) (((uint32_t)(x) & CSR_SSTATUS_SIE_MASK) >> CSR_SSTATUS_SIE_SHIFT)

/*
 * UIE (RW)
 *
 * U mode interrupt enable bit.
 * 0 Disabled
 * 1 Enabled
 */
#define CSR_SSTATUS_UIE_MASK (0x1U)
#define CSR_SSTATUS_UIE_SHIFT (0U)
#define CSR_SSTATUS_UIE_SET(x) (((uint32_t)(x) << CSR_SSTATUS_UIE_SHIFT) & CSR_SSTATUS_UIE_MASK)
#define CSR_SSTATUS_UIE_GET(x) (((uint32_t)(x) & CSR_SSTATUS_UIE_MASK) >> CSR_SSTATUS_UIE_SHIFT)

/* Bitfield definition for register: SEDELEG */
/*
 * SPF (RW)
 *
 * SPF indicates whether a Store/AMO Page Fault exception will be delegated to U-mode
 * 0:Do not redirect
 * 1:Redirect
 */
#define CSR_SEDELEG_SPF_MASK (0x8000U)
#define CSR_SEDELEG_SPF_SHIFT (15U)
#define CSR_SEDELEG_SPF_SET(x) (((uint32_t)(x) << CSR_SEDELEG_SPF_SHIFT) & CSR_SEDELEG_SPF_MASK)
#define CSR_SEDELEG_SPF_GET(x) (((uint32_t)(x) & CSR_SEDELEG_SPF_MASK) >> CSR_SEDELEG_SPF_SHIFT)

/*
 * LPF (RW)
 *
 * LPF indicates whether a Load Page Fault exception will be delegated to U-mode
 * 0:Do not redirect
 * 1:Redirect
 */
#define CSR_SEDELEG_LPF_MASK (0x2000U)
#define CSR_SEDELEG_LPF_SHIFT (13U)
#define CSR_SEDELEG_LPF_SET(x) (((uint32_t)(x) << CSR_SEDELEG_LPF_SHIFT) & CSR_SEDELEG_LPF_MASK)
#define CSR_SEDELEG_LPF_GET(x) (((uint32_t)(x) & CSR_SEDELEG_LPF_MASK) >> CSR_SEDELEG_LPF_SHIFT)

/*
 * IPF (RW)
 *
 * IPF indicates whether an Instruction Page Fault exception will be delegated to U-mode
 * 0:Do not redirect
 * 1:Redirect
 */
#define CSR_SEDELEG_IPF_MASK (0x1000U)
#define CSR_SEDELEG_IPF_SHIFT (12U)
#define CSR_SEDELEG_IPF_SET(x) (((uint32_t)(x) << CSR_SEDELEG_IPF_SHIFT) & CSR_SEDELEG_IPF_MASK)
#define CSR_SEDELEG_IPF_GET(x) (((uint32_t)(x) & CSR_SEDELEG_IPF_MASK) >> CSR_SEDELEG_IPF_SHIFT)

/*
 * UEC (RW)
 *
 * UEC indicates whether an exception triggered by environment call from U-mode will be delegated to U-mode
 * 0:Do not redirect
 * 1:Redirect
 */
#define CSR_SEDELEG_UEC_MASK (0x100U)
#define CSR_SEDELEG_UEC_SHIFT (8U)
#define CSR_SEDELEG_UEC_SET(x) (((uint32_t)(x) << CSR_SEDELEG_UEC_SHIFT) & CSR_SEDELEG_UEC_MASK)
#define CSR_SEDELEG_UEC_GET(x) (((uint32_t)(x) & CSR_SEDELEG_UEC_MASK) >> CSR_SEDELEG_UEC_SHIFT)

