hpmicro/hpm_sdk/soc/HPM5E00/HPM5E3Y/hpm_csr_regs.h
/*
 * USIE (RW)
 *
 * U mode software interrupt enable bit.
 * 0:Disabled
 * 1:Enabled
 */
#define CSR_SIE_USIE_MASK (0x1U)
#define CSR_SIE_USIE_SHIFT (0U)
#define CSR_SIE_USIE_SET(x) (((uint32_t)(x) << CSR_SIE_USIE_SHIFT) & CSR_SIE_USIE_MASK)
#define CSR_SIE_USIE_GET(x) (((uint32_t)(x) & CSR_SIE_USIE_MASK) >> CSR_SIE_USIE_SHIFT)

/* Bitfield definition for register: STVEC */
/*
 * BASE_31_2 (RW)
 *
 * Base address for interrupt and exception handlers. See description above for alignment requirements when PLIC is in the vector mode.
 */
#define CSR_STVEC_BASE_31_2_MASK (0xFFFFFFFCUL)
#define CSR_STVEC_BASE_31_2_SHIFT (2U)
#define CSR_STVEC_BASE_31_2_SET(x) (((uint32_t)(x) << CSR_STVEC_BASE_31_2_SHIFT) & CSR_STVEC_BASE_31_2_MASK)
#define CSR_STVEC_BASE_31_2_GET(x) (((uint32_t)(x) & CSR_STVEC_BASE_31_2_MASK) >> CSR_STVEC_BASE_31_2_SHIFT)

/* Bitfield definition for register: SSCRATCH */
/*
 * SSCRATCH (RW)
 *
 * Scratch register storage.
 */
#define CSR_SSCRATCH_SSCRATCH_MASK (0xFFFFFFFFUL)
#define CSR_SSCRATCH_SSCRATCH_SHIFT (0U)
#define CSR_SSCRATCH_SSCRATCH_SET(x) (((uint32_t)(x) << CSR_SSCRATCH_SSCRATCH_SHIFT) & CSR_SSCRATCH_SSCRATCH_MASK)
#define CSR_SSCRATCH_SSCRATCH_GET(x) (((uint32_t)(x) & CSR_SSCRATCH_SSCRATCH_MASK) >> CSR_SSCRATCH_SSCRATCH_SHIFT)

/* Bitfield definition for register: SEPC */
/*
 * EPC (RW)
 *
 * Exception program counter.
 */
#define CSR_SEPC_EPC_MASK (0xFFFFFFFEUL)
#define CSR_SEPC_EPC_SHIFT (1U)
#define CSR_SEPC_EPC_SET(x) (((uint32_t)(x) << CSR_SEPC_EPC_SHIFT) & CSR_SEPC_EPC_MASK)
#define CSR_SEPC_EPC_GET(x) (((uint32_t)(x) & CSR_SEPC_EPC_MASK) >> CSR_SEPC_EPC_SHIFT)

/* Bitfield definition for register: SCAUSE */
/*
 * INTERRUPT (RW)
 *
 * Interrupt.
 */
#define CSR_SCAUSE_INTERRUPT_MASK (0x80000000UL)
#define CSR_SCAUSE_INTERRUPT_SHIFT (31U)
#define CSR_SCAUSE_INTERRUPT_SET(x) (((uint32_t)(x) << CSR_SCAUSE_INTERRUPT_SHIFT) & CSR_SCAUSE_INTERRUPT_MASK)
#define CSR_SCAUSE_INTERRUPT_GET(x) (((uint32_t)(x) & CSR_SCAUSE_INTERRUPT_MASK) >> CSR_SCAUSE_INTERRUPT_SHIFT)

/*
 * EXCEPTION_CODE (RW)
 *
 * Exception Code.
 * When interrupt is 1:
 * 0:User software interrupt
 * 1:Supervisor software interrupt
 * 4:User timer interrupt
 * 5:Supervisor timer interrupt
 * 8:User external interrupt
 * 9:Supervisor external interrupt
 * 256+16:Slave port ECC error interrupt (S-mode)
 * 256+17:Bus write transaction error interrupt (S-mode)
 * 256+18:Performance monitor overflow interrupt(S-mode)
 * When interrupt is 0:
 * 0:Instruction address misaligned
 * 1:Instruction access fault
 * 2:Illegal instruction
 * 3:Breakpoint
 * 4:Load address misaligned
 * 5:Load access fault
 * 6:Store/AMO address misaligned
 * 7:Store/AMO access fault
 * 8:Environment call from U-mode
 * 9:Environment call from S-mode
 * 11:10:Reserved
 * 12:Instruction page fault
 * 13:Load page fault
 * 14:Reserved
 * 15:Store/AMO page fault
 * 32:Stack overflow exception
 * 33:Stack underflow exception
 * 40-47:Reserved
 */
#define CSR_SCAUSE_EXCEPTION_CODE_MASK (0x3FFU)
#define CSR_SCAUSE_EXCEPTION_CODE_SHIFT (0U)
#define CSR_SCAUSE_EXCEPTION_CODE_SET(x) (((uint32_t)(x) << CSR_SCAUSE_EXCEPTION_CODE_SHIFT) & CSR_SCAUSE_EXCEPTION_CODE_MASK)
#define CSR_SCAUSE_EXCEPTION_CODE_GET(x) (((uint32_t)(x) & CSR_SCAUSE_EXCEPTION_CODE_MASK) >> CSR_SCAUSE_EXCEPTION_CODE_SHIFT)

/* Bitfield definition for register: STVAL */
/*
 * STVAL (RW)
 *
 * Exception-specific information for software trap handling.
 */
#define CSR_STVAL_STVAL_MASK (0xFFFFFFFFUL)
#define CSR_STVAL_STVAL_SHIFT (0U)
#define CSR_STVAL_STVAL_SET(x) (((uint32_t)(x) << CSR_STVAL_STVAL_SHIFT) & CSR_STVAL_STVAL_MASK)
#define CSR_STVAL_STVAL_GET(x) (((uint32_t)(x) & CSR_STVAL_STVAL_MASK) >> CSR_STVAL_STVAL_SHIFT)

/* Bitfield definition for register: SIP */
/*
 * SEIP (RO)
 *
 * S mode external interrupt pending bit.
 * 0:Not pending
 * 1:Pending
 */
#define CSR_SIP_SEIP_MASK (0x200U)
#define CSR_SIP_SEIP_SHIFT (9U)
#define CSR_SIP_SEIP_GET(x) (((uint32_t)(x) & CSR_SIP_SEIP_MASK) >> CSR_SIP_SEIP_SHIFT)

/*
 * UEIP (RW)
 *
 * U mode external interrupt pending bit.
 * 0:Not pending
 * 1:Pending
 */
#define CSR_SIP_UEIP_MASK (0x100U)
#define CSR_SIP_UEIP_SHIFT (8U)
#define CSR_SIP_UEIP_SET(x) (((uint32_t)(x) << CSR_SIP_UEIP_SHIFT) & CSR_SIP_UEIP_MASK)
#define CSR_SIP_UEIP_GET(x) (((uint32_t)(x) & CSR_SIP_UEIP_MASK) >> CSR_SIP_UEIP_SHIFT)

/*
 * STIP (RO)
 *
 * S mode timer interrupt pending bit.
 * 0:Not pending
 * 1:Pending
 */
#define CSR_SIP_STIP_MASK (0x20U)
#define CSR_SIP_STIP_SHIFT (5U)
#define CSR_SIP_STIP_GET(x) (((uint32_t)(x) & CSR_SIP_STIP_MASK) >> CSR_SIP_STIP_SHIFT)

/*
 * UTIP (RO)
 *
 * U mode timer interrupt pending bit
 * 0:Not pending
 * 1:Pending
 */
#define CSR_SIP_UTIP_MASK (0x10U)
#define CSR_SIP_UTIP_SHIFT (4U)
#define CSR_SIP_UTIP_GET(x) (((uint32_t)(x) & CSR_SIP_UTIP_MASK) >> CSR_SIP_UTIP_SHIFT)

/*
 * SSIP (RW)
 *
 * S mode software interrupt pending bit.
 * 0:Not pending
 * 1:Pending
 */
#define CSR_SIP_SSIP_MASK (0x2U)
#define CSR_SIP_SSIP_SHIFT (1U)
#define CSR_SIP_SSIP_SET(x) (((uint32_t)(x) << CSR_SIP_SSIP_SHIFT) & CSR_SIP_SSIP_MASK)
#define CSR_SIP_SSIP_GET(x) (((uint32_t)(x) & CSR_SIP_SSIP_MASK) >> CSR_SIP_SSIP_SHIFT)

/*
 * USIP (RW)
 *
 * U mode software interrupt pending bit.
 * 0:Not pending
 * 1:Pending
 */
#define CSR_SIP_USIP_MASK (0x1U)
#define CSR_SIP_USIP_SHIFT (0U)
#define CSR_SIP_USIP_SET(x) (((uint32_t)(x) << CSR_SIP_USIP_SHIFT) & CSR_SIP_USIP_MASK)
#define CSR_SIP_USIP_GET(x) (((uint32_t)(x) & CSR_SIP_USIP_MASK) >> CSR_SIP_USIP_SHIFT)

/* Bitfield definition for register: SATP */
/*
 * MODE (RW)
 *
 * MODE holds the page translation mode. When MODE is Bare, virtual addresses are equal to physical addresses in S-mode. When MMU is
 * not supported in the product, this CSR will be
 * hardwired to 0.
 * 0:No page translation
 * 1:Page-based 32-bit virtual addressing
 */
#define CSR_SATP_MODE_MASK (0x80000000UL)
#define CSR_SATP_MODE_SHIFT (31U)
#define CSR_SATP_MODE_SET(x) (((uint32_t)(x) << CSR_SATP_MODE_SHIFT) & CSR_SATP_MODE_MASK)
#define CSR_SATP_MODE_GET(x) (((uint32_t)(x) & CSR_SATP_MODE_MASK) >> CSR_SATP_MODE_SHIFT)

