hpmicro/hpm_sdk/soc/HPM5E00/HPM5E3Y/hpm_csr_regs.h
/*
 * MTE (RW)
 *
 * M-mode trigger enable field. When a trap into M-mode is taken, MTE is set to 0. When the MRET instruction is executed, MTE is set to the value of MPTE.
 * 0:Triggers do not match/fire while the hart is in M-mode.
 * 1:Triggers do match/fire while the hart is in M-mode.
 */
#define CSR_TCONTROL_MTE_MASK (0x8U)
#define CSR_TCONTROL_MTE_SHIFT (3U)
#define CSR_TCONTROL_MTE_SET(x) (((uint32_t)(x) << CSR_TCONTROL_MTE_SHIFT) & CSR_TCONTROL_MTE_MASK)
#define CSR_TCONTROL_MTE_GET(x) (((uint32_t)(x) & CSR_TCONTROL_MTE_MASK) >> CSR_TCONTROL_MTE_SHIFT)

/* Bitfield definition for register: MCONTEXT */
/*
 * MCONTEXT (RW)
 *
 * Machine mode software can write a context number to this register, which can be used to set triggers that only fire in that specific context.
 */
#define CSR_MCONTEXT_MCONTEXT_MASK (0x3FU)
#define CSR_MCONTEXT_MCONTEXT_SHIFT (0U)
#define CSR_MCONTEXT_MCONTEXT_SET(x) (((uint32_t)(x) << CSR_MCONTEXT_MCONTEXT_SHIFT) & CSR_MCONTEXT_MCONTEXT_MASK)
#define CSR_MCONTEXT_MCONTEXT_GET(x) (((uint32_t)(x) & CSR_MCONTEXT_MCONTEXT_MASK) >> CSR_MCONTEXT_MCONTEXT_SHIFT)

/* Bitfield definition for register: SCONTEXT */
/*
 * SCONTEXT (RW)
 *
 * Machine mode software can write a context number to this register, which can be used to set triggers that only fire in that specific context.
 */
#define CSR_SCONTEXT_SCONTEXT_MASK (0x1FFU)
#define CSR_SCONTEXT_SCONTEXT_SHIFT (0U)
#define CSR_SCONTEXT_SCONTEXT_SET(x) (((uint32_t)(x) << CSR_SCONTEXT_SCONTEXT_SHIFT) & CSR_SCONTEXT_SCONTEXT_MASK)
#define CSR_SCONTEXT_SCONTEXT_GET(x) (((uint32_t)(x) & CSR_SCONTEXT_SCONTEXT_MASK) >> CSR_SCONTEXT_SCONTEXT_SHIFT)

/* Bitfield definition for register: DCSR */
/*
 * XDEBUGVER (RO)
 *
 * Version of the external debugger. 0 indicates that no external debugger exists and 4 indicates that the external debugger conforms to the RISC-V External Debug Support (TD003) V0.13
 */
#define CSR_DCSR_XDEBUGVER_MASK (0xF0000000UL)
#define CSR_DCSR_XDEBUGVER_SHIFT (28U)
#define CSR_DCSR_XDEBUGVER_GET(x) (((uint32_t)(x) & CSR_DCSR_XDEBUGVER_MASK) >> CSR_DCSR_XDEBUGVER_SHIFT)

/*
 * EBREAKM (RW)
 *
 * This bit controls the behavior of EBREAK instructions in Machine Mode
 * 0:Generate a regular breakpoint exception
 * 1:Enter Debug Mode
 */
#define CSR_DCSR_EBREAKM_MASK (0x8000U)
#define CSR_DCSR_EBREAKM_SHIFT (15U)
#define CSR_DCSR_EBREAKM_SET(x) (((uint32_t)(x) << CSR_DCSR_EBREAKM_SHIFT) & CSR_DCSR_EBREAKM_MASK)
#define CSR_DCSR_EBREAKM_GET(x) (((uint32_t)(x) & CSR_DCSR_EBREAKM_MASK) >> CSR_DCSR_EBREAKM_SHIFT)

/*
 * EBREAKS (RW)
 *
 * This bit controls the behavior of EBREAK instructions in Supervisor Mode.
 * 0:Generate a regular breakpoint exception
 * 1:Enter Debug Mode
 */
#define CSR_DCSR_EBREAKS_MASK (0x2000U)
#define CSR_DCSR_EBREAKS_SHIFT (13U)
#define CSR_DCSR_EBREAKS_SET(x) (((uint32_t)(x) << CSR_DCSR_EBREAKS_SHIFT) & CSR_DCSR_EBREAKS_MASK)
#define CSR_DCSR_EBREAKS_GET(x) (((uint32_t)(x) & CSR_DCSR_EBREAKS_MASK) >> CSR_DCSR_EBREAKS_SHIFT)

/*
 * EBREAKU (RW)
 *
 * This bit controls the behavior of EBREAK instructions in User/Application Mode
 * 0:Generate a regular breakpoint exception
 * 1:Enter Debug Mode
 */
#define CSR_DCSR_EBREAKU_MASK (0x1000U)
#define CSR_DCSR_EBREAKU_SHIFT (12U)
#define CSR_DCSR_EBREAKU_SET(x) (((uint32_t)(x) << CSR_DCSR_EBREAKU_SHIFT) & CSR_DCSR_EBREAKU_MASK)
#define CSR_DCSR_EBREAKU_GET(x) (((uint32_t)(x) & CSR_DCSR_EBREAKU_MASK) >> CSR_DCSR_EBREAKU_SHIFT)

/*
 * STEPIE (RW)
 *
 * This bit controls whether interrupts are enabled during single stepping
 * 0:Disable interrupts during single stepping
 * 1:Allow interrupts in single stepping
 */
#define CSR_DCSR_STEPIE_MASK (0x800U)
#define CSR_DCSR_STEPIE_SHIFT (11U)
#define CSR_DCSR_STEPIE_SET(x) (((uint32_t)(x) << CSR_DCSR_STEPIE_SHIFT) & CSR_DCSR_STEPIE_MASK)
#define CSR_DCSR_STEPIE_GET(x) (((uint32_t)(x) & CSR_DCSR_STEPIE_MASK) >> CSR_DCSR_STEPIE_SHIFT)

/*
 * STOPCOUNT (RW)
 *
 * This bit controls whether performance counters are stopped in Debug Mode.
 * 0:Do not stop counters in Debug Mode
 * 1:Stop counters in Debug Mode
 */
#define CSR_DCSR_STOPCOUNT_MASK (0x400U)
#define CSR_DCSR_STOPCOUNT_SHIFT (10U)
#define CSR_DCSR_STOPCOUNT_SET(x) (((uint32_t)(x) << CSR_DCSR_STOPCOUNT_SHIFT) & CSR_DCSR_STOPCOUNT_MASK)
#define CSR_DCSR_STOPCOUNT_GET(x) (((uint32_t)(x) & CSR_DCSR_STOPCOUNT_MASK) >> CSR_DCSR_STOPCOUNT_SHIFT)

/*
 * STOPTIME (RW)
 *
 * This bit controls whether timers are stopped in Debug Mode. The processor only drives its stoptime output pin to 1 if it is in Debug Mode and this bit is set. Integration effort is required to make timers in the platform observe this pin to really stop them.
 * 0:Do not stop timers in Debug Mode
 * 1:Stop timers in Debug Mode
 */
#define CSR_DCSR_STOPTIME_MASK (0x200U)
#define CSR_DCSR_STOPTIME_SHIFT (9U)
#define CSR_DCSR_STOPTIME_SET(x) (((uint32_t)(x) << CSR_DCSR_STOPTIME_SHIFT) & CSR_DCSR_STOPTIME_MASK)
#define CSR_DCSR_STOPTIME_GET(x) (((uint32_t)(x) & CSR_DCSR_STOPTIME_MASK) >> CSR_DCSR_STOPTIME_SHIFT)

/*
 * CAUSE (RO)
 *
 * Reason why Debug Mode was entered. When there are multiple reasons to enter Debug Mode, the priority to determine the CAUSE value will be: trigger module > EBREAK > halt-on-reset > halt request > single step. Halt requests are requests issued by the external debugger
 * 0:Reserved
 * 1:EBREAK
 * 2:Trigger module
 * 3:Halt request
 * 4:Single step
 * 5:Halt-on-reset
 * 6-7:Reserved
 */
#define CSR_DCSR_CAUSE_MASK (0x1C0U)
#define CSR_DCSR_CAUSE_SHIFT (6U)
#define CSR_DCSR_CAUSE_GET(x) (((uint32_t)(x) & CSR_DCSR_CAUSE_MASK) >> CSR_DCSR_CAUSE_SHIFT)

/*
 * MPRVEN (RW)
 *
 * This bit controls whether mstatus.MPRV takes effect in Debug Mode.
 * 0:MPRV in mstatus is ignored in Debug Mode.
 * 1:MPRV in mstatus takes effect in Debug Mode.
 */
#define CSR_DCSR_MPRVEN_MASK (0x10U)
#define CSR_DCSR_MPRVEN_SHIFT (4U)
#define CSR_DCSR_MPRVEN_SET(x) (((uint32_t)(x) << CSR_DCSR_MPRVEN_SHIFT) & CSR_DCSR_MPRVEN_MASK)
#define CSR_DCSR_MPRVEN_GET(x) (((uint32_t)(x) & CSR_DCSR_MPRVEN_MASK) >> CSR_DCSR_MPRVEN_SHIFT)

