hpmicro/hpm_sdk/soc/HPM5E00/HPM5E3Y/hpm_csr_regs.h
/*
 * NMIP (RO)
 *
 * When this bit is set, there is a Non-Maskable-Interrupt (NMI) pending for the hart. Since an NMI can indicate a hardware error condition, reliable debugging may no longer be possible once this bit becomes set.
 */
#define CSR_DCSR_NMIP_MASK (0x8U)
#define CSR_DCSR_NMIP_SHIFT (3U)
#define CSR_DCSR_NMIP_GET(x) (((uint32_t)(x) & CSR_DCSR_NMIP_MASK) >> CSR_DCSR_NMIP_SHIFT)

/*
 * STEP (RW)
 *
 * This bit controls whether non-Debug Mode instruction execution is in the single step mode. When set, the hart returns to Debug Mode after a single instruction execution. If the instruction does not complete due to an exception, the hart will immediately enter Debug Mode before executing the trap handler, with appropriate exception registers set.
 * 0:Single Step Mode is off
 * 1:Single Step Mode is on
 */
#define CSR_DCSR_STEP_MASK (0x4U)
#define CSR_DCSR_STEP_SHIFT (2U)
#define CSR_DCSR_STEP_SET(x) (((uint32_t)(x) << CSR_DCSR_STEP_SHIFT) & CSR_DCSR_STEP_MASK)
#define CSR_DCSR_STEP_GET(x) (((uint32_t)(x) & CSR_DCSR_STEP_MASK) >> CSR_DCSR_STEP_SHIFT)

/*
 * PRV (RW)
 *
 * The privilege level that the hart was operating in when Debug Mode was entered. The external debugger can modify this value to change the hart’s privilege level when exiting Debug Mode.
 * 0:User/Application
 * 1:Supervisor
 * 2:Reserved
 * 3:Machine
 */
#define CSR_DCSR_PRV_MASK (0x3U)
#define CSR_DCSR_PRV_SHIFT (0U)
#define CSR_DCSR_PRV_SET(x) (((uint32_t)(x) << CSR_DCSR_PRV_SHIFT) & CSR_DCSR_PRV_MASK)
#define CSR_DCSR_PRV_GET(x) (((uint32_t)(x) & CSR_DCSR_PRV_MASK) >> CSR_DCSR_PRV_SHIFT)

/* Bitfield definition for register: DPC */
/*
 * DPC (RW)
 *
 * Debug Program Counter. Bit 0 is hardwired to 0.
 */
#define CSR_DPC_DPC_MASK (0xFFFFFFFFUL)
#define CSR_DPC_DPC_SHIFT (0U)
#define CSR_DPC_DPC_SET(x) (((uint32_t)(x) << CSR_DPC_DPC_SHIFT) & CSR_DPC_DPC_MASK)
#define CSR_DPC_DPC_GET(x) (((uint32_t)(x) & CSR_DPC_DPC_MASK) >> CSR_DPC_DPC_SHIFT)

/* Bitfield definition for register: DSCRATCH0 */
/*
 * DSCRATCH (RO)
 *
 * A scratch register that is reserved for use by Debug Module.
 */
#define CSR_DSCRATCH0_DSCRATCH_MASK (0xFFFFFFFFUL)
#define CSR_DSCRATCH0_DSCRATCH_SHIFT (0U)
#define CSR_DSCRATCH0_DSCRATCH_GET(x) (((uint32_t)(x) & CSR_DSCRATCH0_DSCRATCH_MASK) >> CSR_DSCRATCH0_DSCRATCH_SHIFT)

/* Bitfield definition for register: DSCRATCH1 */
/*
 * DSCRATCH (RO)
 *
 * A scratch register that is reserved for use by Debug Module.
 */
#define CSR_DSCRATCH1_DSCRATCH_MASK (0xFFFFFFFFUL)
#define CSR_DSCRATCH1_DSCRATCH_SHIFT (0U)
#define CSR_DSCRATCH1_DSCRATCH_GET(x) (((uint32_t)(x) & CSR_DSCRATCH1_DSCRATCH_MASK) >> CSR_DSCRATCH1_DSCRATCH_SHIFT)

/* Bitfield definition for register: MCYCLE */
/*
 * COUNTER (RW)
 *
 * the lower 32 bits of Machine Cycle Counter
 */
#define CSR_MCYCLE_COUNTER_MASK (0xFFFFFFFFUL)
#define CSR_MCYCLE_COUNTER_SHIFT (0U)
#define CSR_MCYCLE_COUNTER_SET(x) (((uint32_t)(x) << CSR_MCYCLE_COUNTER_SHIFT) & CSR_MCYCLE_COUNTER_MASK)
#define CSR_MCYCLE_COUNTER_GET(x) (((uint32_t)(x) & CSR_MCYCLE_COUNTER_MASK) >> CSR_MCYCLE_COUNTER_SHIFT)

/* Bitfield definition for register: MINSTRET */
/*
 * COUNTER (RW)
 *
 * the lower 32 bits of Machine Instruction-Retired Counter
 */
#define CSR_MINSTRET_COUNTER_MASK (0xFFFFFFFFUL)
#define CSR_MINSTRET_COUNTER_SHIFT (0U)
#define CSR_MINSTRET_COUNTER_SET(x) (((uint32_t)(x) << CSR_MINSTRET_COUNTER_SHIFT) & CSR_MINSTRET_COUNTER_MASK)
#define CSR_MINSTRET_COUNTER_GET(x) (((uint32_t)(x) & CSR_MINSTRET_COUNTER_MASK) >> CSR_MINSTRET_COUNTER_SHIFT)

/* Bitfield definition for register: MHPMCOUNTER3 */
/*
 * COUNTER (RW)
 *
 * count the num- ber of events selected by mhpmevent3
 */
#define CSR_MHPMCOUNTER3_COUNTER_MASK (0xFFFFFFFFUL)
#define CSR_MHPMCOUNTER3_COUNTER_SHIFT (0U)
#define CSR_MHPMCOUNTER3_COUNTER_SET(x) (((uint32_t)(x) << CSR_MHPMCOUNTER3_COUNTER_SHIFT) & CSR_MHPMCOUNTER3_COUNTER_MASK)
#define CSR_MHPMCOUNTER3_COUNTER_GET(x) (((uint32_t)(x) & CSR_MHPMCOUNTER3_COUNTER_MASK) >> CSR_MHPMCOUNTER3_COUNTER_SHIFT)

/* Bitfield definition for register: MHPMCOUNTER4 */
/*
 * COUNTER (RW)
 *
 * count the num- ber of events selected by mhpmevent4
 */
#define CSR_MHPMCOUNTER4_COUNTER_MASK (0xFFFFFFFFUL)
#define CSR_MHPMCOUNTER4_COUNTER_SHIFT (0U)
#define CSR_MHPMCOUNTER4_COUNTER_SET(x) (((uint32_t)(x) << CSR_MHPMCOUNTER4_COUNTER_SHIFT) & CSR_MHPMCOUNTER4_COUNTER_MASK)
#define CSR_MHPMCOUNTER4_COUNTER_GET(x) (((uint32_t)(x) & CSR_MHPMCOUNTER4_COUNTER_MASK) >> CSR_MHPMCOUNTER4_COUNTER_SHIFT)

/* Bitfield definition for register: MHPMCOUNTER5 */
/*
 * COUNTER (RW)
 *
 * count the num- ber of events selected by mhpmevent5
 */
#define CSR_MHPMCOUNTER5_COUNTER_MASK (0xFFFFFFFFUL)
#define CSR_MHPMCOUNTER5_COUNTER_SHIFT (0U)
#define CSR_MHPMCOUNTER5_COUNTER_SET(x) (((uint32_t)(x) << CSR_MHPMCOUNTER5_COUNTER_SHIFT) & CSR_MHPMCOUNTER5_COUNTER_MASK)
#define CSR_MHPMCOUNTER5_COUNTER_GET(x) (((uint32_t)(x) & CSR_MHPMCOUNTER5_COUNTER_MASK) >> CSR_MHPMCOUNTER5_COUNTER_SHIFT)

/* Bitfield definition for register: MHPMCOUNTER6 */
/*
 * COUNTER (RW)
 *
 * count the num- ber of events selected by mhpmevent6
 */
#define CSR_MHPMCOUNTER6_COUNTER_MASK (0xFFFFFFFFUL)
#define CSR_MHPMCOUNTER6_COUNTER_SHIFT (0U)
#define CSR_MHPMCOUNTER6_COUNTER_SET(x) (((uint32_t)(x) << CSR_MHPMCOUNTER6_COUNTER_SHIFT) & CSR_MHPMCOUNTER6_COUNTER_MASK)
#define CSR_MHPMCOUNTER6_COUNTER_GET(x) (((uint32_t)(x) & CSR_MHPMCOUNTER6_COUNTER_MASK) >> CSR_MHPMCOUNTER6_COUNTER_SHIFT)

/* Bitfield definition for register: MCYCLEH */
/*
 * COUNTER (RW)
 *
 * the higher 32 bits of Machine Cycle Counter
 */
#define CSR_MCYCLEH_COUNTER_MASK (0xFFFFFFFFUL)
#define CSR_MCYCLEH_COUNTER_SHIFT (0U)
#define CSR_MCYCLEH_COUNTER_SET(x) (((uint32_t)(x) << CSR_MCYCLEH_COUNTER_SHIFT) & CSR_MCYCLEH_COUNTER_MASK)
#define CSR_MCYCLEH_COUNTER_GET(x) (((uint32_t)(x) & CSR_MCYCLEH_COUNTER_MASK) >> CSR_MCYCLEH_COUNTER_SHIFT)

/* Bitfield definition for register: MINSTRETH */
/*
 * COUNTER (RW)
 *
 * the higher 32 bits of Machine Instruction-Retired Counter
 */
#define CSR_MINSTRETH_COUNTER_MASK (0xFFFFFFFFUL)
#define CSR_MINSTRETH_COUNTER_SHIFT (0U)
#define CSR_MINSTRETH_COUNTER_SET(x) (((uint32_t)(x) << CSR_MINSTRETH_COUNTER_SHIFT) & CSR_MINSTRETH_COUNTER_MASK)
#define CSR_MINSTRETH_COUNTER_GET(x) (((uint32_t)(x) & CSR_MINSTRETH_COUNTER_MASK) >> CSR_MINSTRETH_COUNTER_SHIFT)

/* Bitfield definition for register: MHPMCOUNTER3H */
/*
 * COUNTER (RW)
 *
 * count the num- ber of events selected by mhpmevent3
 */
#define CSR_MHPMCOUNTER3H_COUNTER_MASK (0xFFFFFFFFUL)
#define CSR_MHPMCOUNTER3H_COUNTER_SHIFT (0U)
#define CSR_MHPMCOUNTER3H_COUNTER_SET(x) (((uint32_t)(x) << CSR_MHPMCOUNTER3H_COUNTER_SHIFT) & CSR_MHPMCOUNTER3H_COUNTER_MASK)
#define CSR_MHPMCOUNTER3H_COUNTER_GET(x) (((uint32_t)(x) & CSR_MHPMCOUNTER3H_COUNTER_MASK) >> CSR_MHPMCOUNTER3H_COUNTER_SHIFT)

/* Bitfield definition for register: MHPMCOUNTER4H */
/*
 * COUNTER (RW)
 *
 * count the num- ber of events selected by mhpmevent4
 */
#define CSR_MHPMCOUNTER4H_COUNTER_MASK (0xFFFFFFFFUL)
#define CSR_MHPMCOUNTER4H_COUNTER_SHIFT (0U)
#define CSR_MHPMCOUNTER4H_COUNTER_SET(x) (((uint32_t)(x) << CSR_MHPMCOUNTER4H_COUNTER_SHIFT) & CSR_MHPMCOUNTER4H_COUNTER_MASK)
#define CSR_MHPMCOUNTER4H_COUNTER_GET(x) (((uint32_t)(x) & CSR_MHPMCOUNTER4H_COUNTER_MASK) >> CSR_MHPMCOUNTER4H_COUNTER_SHIFT)

/* Bitfield definition for register: MHPMCOUNTER5H */
/*
 * COUNTER (RW)
 *
 * count the num- ber of events selected by mhpmevent5
 */
#define CSR_MHPMCOUNTER5H_COUNTER_MASK (0xFFFFFFFFUL)
#define CSR_MHPMCOUNTER5H_COUNTER_SHIFT (0U)
#define CSR_MHPMCOUNTER5H_COUNTER_SET(x) (((uint32_t)(x) << CSR_MHPMCOUNTER5H_COUNTER_SHIFT) & CSR_MHPMCOUNTER5H_COUNTER_MASK)
#define CSR_MHPMCOUNTER5H_COUNTER_GET(x) (((uint32_t)(x) & CSR_MHPMCOUNTER5H_COUNTER_MASK) >> CSR_MHPMCOUNTER5H_COUNTER_SHIFT)

/* Bitfield definition for register: MHPMCOUNTER6H */
/*
 * COUNTER (RW)
 *
 * count the num- ber of events selected by mhpmevent6
 */
#define CSR_MHPMCOUNTER6H_COUNTER_MASK (0xFFFFFFFFUL)
#define CSR_MHPMCOUNTER6H_COUNTER_SHIFT (0U)
#define CSR_MHPMCOUNTER6H_COUNTER_SET(x) (((uint32_t)(x) << CSR_MHPMCOUNTER6H_COUNTER_SHIFT) & CSR_MHPMCOUNTER6H_COUNTER_MASK)
#define CSR_MHPMCOUNTER6H_COUNTER_GET(x) (((uint32_t)(x) & CSR_MHPMCOUNTER6H_COUNTER_MASK) >> CSR_MHPMCOUNTER6H_COUNTER_SHIFT)

/* Bitfield definition for register: PMACFG0 */
/*
 * PMA3CFG (RW)
 *
 * See PMACFG Table
 */
#define CSR_PMACFG0_PMA3CFG_MASK (0xFF000000UL)
#define CSR_PMACFG0_PMA3CFG_SHIFT (24U)
#define CSR_PMACFG0_PMA3CFG_SET(x) (((uint32_t)(x) << CSR_PMACFG0_PMA3CFG_SHIFT) & CSR_PMACFG0_PMA3CFG_MASK)
#define CSR_PMACFG0_PMA3CFG_GET(x) (((uint32_t)(x) & CSR_PMACFG0_PMA3CFG_MASK) >> CSR_PMACFG0_PMA3CFG_SHIFT)

