hpmicro/hpm_sdk/soc/HPM5E00/HPM5E3Y/hpm_csr_regs.h
/*
 * HPM5 (RW)
 *
 * See register description
 */
#define CSR_MCOUNTEROVF_HPM5_MASK (0x20U)
#define CSR_MCOUNTEROVF_HPM5_SHIFT (5U)
#define CSR_MCOUNTEROVF_HPM5_SET(x) (((uint32_t)(x) << CSR_MCOUNTEROVF_HPM5_SHIFT) & CSR_MCOUNTEROVF_HPM5_MASK)
#define CSR_MCOUNTEROVF_HPM5_GET(x) (((uint32_t)(x) & CSR_MCOUNTEROVF_HPM5_MASK) >> CSR_MCOUNTEROVF_HPM5_SHIFT)

/*
 * HPM4 (RW)
 *
 * See register description
 */
#define CSR_MCOUNTEROVF_HPM4_MASK (0x10U)
#define CSR_MCOUNTEROVF_HPM4_SHIFT (4U)
#define CSR_MCOUNTEROVF_HPM4_SET(x) (((uint32_t)(x) << CSR_MCOUNTEROVF_HPM4_SHIFT) & CSR_MCOUNTEROVF_HPM4_MASK)
#define CSR_MCOUNTEROVF_HPM4_GET(x) (((uint32_t)(x) & CSR_MCOUNTEROVF_HPM4_MASK) >> CSR_MCOUNTEROVF_HPM4_SHIFT)

/*
 * HPM3 (RW)
 *
 * See register description
 */
#define CSR_MCOUNTEROVF_HPM3_MASK (0x8U)
#define CSR_MCOUNTEROVF_HPM3_SHIFT (3U)
#define CSR_MCOUNTEROVF_HPM3_SET(x) (((uint32_t)(x) << CSR_MCOUNTEROVF_HPM3_SHIFT) & CSR_MCOUNTEROVF_HPM3_MASK)
#define CSR_MCOUNTEROVF_HPM3_GET(x) (((uint32_t)(x) & CSR_MCOUNTEROVF_HPM3_MASK) >> CSR_MCOUNTEROVF_HPM3_SHIFT)

/*
 * IR (RW)
 *
 * See register description
 */
#define CSR_MCOUNTEROVF_IR_MASK (0x4U)
#define CSR_MCOUNTEROVF_IR_SHIFT (2U)
#define CSR_MCOUNTEROVF_IR_SET(x) (((uint32_t)(x) << CSR_MCOUNTEROVF_IR_SHIFT) & CSR_MCOUNTEROVF_IR_MASK)
#define CSR_MCOUNTEROVF_IR_GET(x) (((uint32_t)(x) & CSR_MCOUNTEROVF_IR_MASK) >> CSR_MCOUNTEROVF_IR_SHIFT)

/*
 * CY (RW)
 *
 * See register description
 */
#define CSR_MCOUNTEROVF_CY_MASK (0x1U)
#define CSR_MCOUNTEROVF_CY_SHIFT (0U)
#define CSR_MCOUNTEROVF_CY_SET(x) (((uint32_t)(x) << CSR_MCOUNTEROVF_CY_SHIFT) & CSR_MCOUNTEROVF_CY_MASK)
#define CSR_MCOUNTEROVF_CY_GET(x) (((uint32_t)(x) & CSR_MCOUNTEROVF_CY_MASK) >> CSR_MCOUNTEROVF_CY_SHIFT)

/* Bitfield definition for register: MSLIDELEG */
/*
 * PMOVI (RW)
 *
 * Delegate S-mode performance monitor overflow local interrupt to S-mode.
 * 0:Do not delegate to S-mode.
 * 1:Delegate to S-mode.
 */
#define CSR_MSLIDELEG_PMOVI_MASK (0x40000UL)
#define CSR_MSLIDELEG_PMOVI_SHIFT (18U)
#define CSR_MSLIDELEG_PMOVI_SET(x) (((uint32_t)(x) << CSR_MSLIDELEG_PMOVI_SHIFT) & CSR_MSLIDELEG_PMOVI_MASK)
#define CSR_MSLIDELEG_PMOVI_GET(x) (((uint32_t)(x) & CSR_MSLIDELEG_PMOVI_MASK) >> CSR_MSLIDELEG_PMOVI_SHIFT)

/*
 * BWEI (RW)
 *
 * Delegate S-mode bus read/write transaction error local interrupt to S-mode
 * 0:Do not delegate to S-mode.
 * 1:Delegate to S-mode.
 */
#define CSR_MSLIDELEG_BWEI_MASK (0x20000UL)
#define CSR_MSLIDELEG_BWEI_SHIFT (17U)
#define CSR_MSLIDELEG_BWEI_SET(x) (((uint32_t)(x) << CSR_MSLIDELEG_BWEI_SHIFT) & CSR_MSLIDELEG_BWEI_MASK)
#define CSR_MSLIDELEG_BWEI_GET(x) (((uint32_t)(x) & CSR_MSLIDELEG_BWEI_MASK) >> CSR_MSLIDELEG_BWEI_SHIFT)

/*
 * IMECCI (RW)
 *
 * Delegate S-mode slave-port ECC error local interrupt to S-mode
 * 0:Do not delegate to S-mode.
 * 1:Delegate to S-mode.
 */
#define CSR_MSLIDELEG_IMECCI_MASK (0x10000UL)
#define CSR_MSLIDELEG_IMECCI_SHIFT (16U)
#define CSR_MSLIDELEG_IMECCI_SET(x) (((uint32_t)(x) << CSR_MSLIDELEG_IMECCI_SHIFT) & CSR_MSLIDELEG_IMECCI_MASK)
#define CSR_MSLIDELEG_IMECCI_GET(x) (((uint32_t)(x) & CSR_MSLIDELEG_IMECCI_MASK) >> CSR_MSLIDELEG_IMECCI_SHIFT)

/* Bitfield definition for register: MCLK_CTL */
/*
 * FUNIT (RW)
 *
 * Level 2 clock gating enable for function units listed in the following table.
 * 16:integer arithmetic unit
 * 17:integer permutation unit
 * 18:integer mask unit
 * 19:integer division unit
 * 20:integer multiply and add unit
 * 21:floating-point multiply and add
 * unit
 * 22:floating-point miscellaneous unit
 * 23:floating-point division unit
 * 24:load/store unit
 * 31:25:Reserved
 */
#define CSR_MCLK_CTL_FUNIT_MASK (0xFFFF0000UL)
#define CSR_MCLK_CTL_FUNIT_SHIFT (16U)
#define CSR_MCLK_CTL_FUNIT_SET(x) (((uint32_t)(x) << CSR_MCLK_CTL_FUNIT_SHIFT) & CSR_MCLK_CTL_FUNIT_MASK)
#define CSR_MCLK_CTL_FUNIT_GET(x) (((uint32_t)(x) & CSR_MCLK_CTL_FUNIT_MASK) >> CSR_MCLK_CTL_FUNIT_SHIFT)

/*
 * VI (RW)
 *
 * Level 1 clock gating enable for the vector/floating-point issue queues.
 */
#define CSR_MCLK_CTL_VI_MASK (0x8000U)
#define CSR_MCLK_CTL_VI_SHIFT (15U)
#define CSR_MCLK_CTL_VI_SET(x) (((uint32_t)(x) << CSR_MCLK_CTL_VI_SHIFT) & CSR_MCLK_CTL_VI_MASK)
#define CSR_MCLK_CTL_VI_GET(x) (((uint32_t)(x) & CSR_MCLK_CTL_VI_MASK) >> CSR_MCLK_CTL_VI_SHIFT)

/*
 * VR (RW)
 *
 * Level 1 clock gating enable for the vector/floating-point register file.
 */
#define CSR_MCLK_CTL_VR_MASK (0x4000U)
#define CSR_MCLK_CTL_VR_SHIFT (14U)
#define CSR_MCLK_CTL_VR_SET(x) (((uint32_t)(x) << CSR_MCLK_CTL_VR_SHIFT) & CSR_MCLK_CTL_VR_MASK)
#define CSR_MCLK_CTL_VR_GET(x) (((uint32_t)(x) & CSR_MCLK_CTL_VR_MASK) >> CSR_MCLK_CTL_VR_SHIFT)

/*
 * AQ (RW)
 *
 * Level 1 clock gating enable for ACE load/store queues.
 */
#define CSR_MCLK_CTL_AQ_MASK (0x2000U)
#define CSR_MCLK_CTL_AQ_SHIFT (13U)
#define CSR_MCLK_CTL_AQ_SET(x) (((uint32_t)(x) << CSR_MCLK_CTL_AQ_SHIFT) & CSR_MCLK_CTL_AQ_MASK)
#define CSR_MCLK_CTL_AQ_GET(x) (((uint32_t)(x) & CSR_MCLK_CTL_AQ_MASK) >> CSR_MCLK_CTL_AQ_SHIFT)

/*
 * DQ (RW)
 *
 * Level 1 clock gating enable for data cache load/store queues.
 */
#define CSR_MCLK_CTL_DQ_MASK (0x1000U)
#define CSR_MCLK_CTL_DQ_SHIFT (12U)
#define CSR_MCLK_CTL_DQ_SET(x) (((uint32_t)(x) << CSR_MCLK_CTL_DQ_SHIFT) & CSR_MCLK_CTL_DQ_MASK)
#define CSR_MCLK_CTL_DQ_GET(x) (((uint32_t)(x) & CSR_MCLK_CTL_DQ_MASK) >> CSR_MCLK_CTL_DQ_SHIFT)

/*
 * UQ (RW)
 *
 * Level 1 clock gating enable for uncached queues
 */
#define CSR_MCLK_CTL_UQ_MASK (0x800U)
#define CSR_MCLK_CTL_UQ_SHIFT (11U)
#define CSR_MCLK_CTL_UQ_SET(x) (((uint32_t)(x) << CSR_MCLK_CTL_UQ_SHIFT) & CSR_MCLK_CTL_UQ_MASK)
#define CSR_MCLK_CTL_UQ_GET(x) (((uint32_t)(x) & CSR_MCLK_CTL_UQ_MASK) >> CSR_MCLK_CTL_UQ_SHIFT)

/*
 * FP (RW)
 *
 * Level 1 clock gating enable for scalar floating point issue unit and queues.
 */
#define CSR_MCLK_CTL_FP_MASK (0x400U)
#define CSR_MCLK_CTL_FP_SHIFT (10U)
#define CSR_MCLK_CTL_FP_SET(x) (((uint32_t)(x) << CSR_MCLK_CTL_FP_SHIFT) & CSR_MCLK_CTL_FP_MASK)
#define CSR_MCLK_CTL_FP_GET(x) (((uint32_t)(x) & CSR_MCLK_CTL_FP_MASK) >> CSR_MCLK_CTL_FP_SHIFT)

